{
  "version": "v7.6.0",
  "url_exe": "https://github.com/UlisesUzcategui/stockpro-updates/releases/download/v7.6.0/StockPro_Setup_v7.6.0.exe",
  "changelog": "StockPro v7.6.0 (Enterprise): Inteligencia Financiera & Auditoría Estratégica\r\nEsta versión representa el salto evolutivo más significativo en la historia de StockPro. Hemos trascendido la gestión operativa de inventario para integrar un Núcleo de Inteligencia de Negocios (BI). Ahora, el sistema no solo le dice qué comprar, sino que audita financieramente cada decisión, calcula el retorno de inversión (ROI) en tiempo real y proyecta el flujo de caja futuro.\r\nAdemás, hemos reescrito la lógica de identificación de productos para garantizar una precisión absoluta en el manejo de variantes y equivalentes.\r\n🧠 Nuevo Módulo: Centro de Inteligencia Financiera (CFO)\r\nUn panel de control diseñado para la Gerencia y la Dirección, enfocado en la rentabilidad neta:\r\nBalance Operativo Neto: Cruce en tiempo real entre el Ahorro Total (logrado por compras eficientes) y el Costo de Oportunidad (dinero dejado de ganar por fallas de stock).\r\nAuditoría Interactiva (Drill-Down): Todos los KPIs son clicables. Puede auditar el origen de cada centavo, viendo exactamente qué órdenes de compra generaron ahorro y qué productos específicos causaron pérdidas.\r\nProyección de Flujo de Caja: Algoritmo predictivo que anualiza los resultados actuales para estimar el impacto financiero al cierre del año fiscal.\r\nÍndices de Salud Financiera: Semáforos inteligentes que evalúan:\r\nROI Operativo: Cuántas veces se paga la operación con los ahorros generados.\r\nCobertura de Fugas: Si la eficiencia de compra es suficiente para cubrir las ineficiencias de inventario.\r\nVisualización Avanzada: Gráficas de tendencia (Ahorro vs Pérdida) con scroll infinito y tooltips educativos que explican el significado financiero de cada métrica.\r\n🛡️ Reingeniería de Datos: Identidad Estricta\r\nHemos blindado la integridad de la base de datos para evitar errores costosos en la reposición de mercancía:\r\nLógica de \"Código + Equivalente\": El sistema ahora distingue matemáticamente entre un repuesto genérico y uno con variante específica (Equivalente), incluso si comparten el mismo código base.\r\nBúsqueda y Asignación Exacta:\r\nEn el Análisis Pareto (ABC): Se clasifican las variantes por separado.\r\nEn el Planificador: Se respeta estrictamente la variante seleccionada; si no existe en proveedores, se crea automáticamente en \"POR COTIZAR\" con la identidad correcta.\r\nNormalización SQL: Implementación de TRIM, UPPER y COALESCE en todas las consultas críticas para evitar duplicados por espacios invisibles o diferencias de mayúsculas/minúsculas.\r\n📊 Mejoras en Análisis Pareto (ABC)\r\nTablas Detalladas: La vista de clasificación completa ahora utiliza \"Celdas Inteligentes\" (Smart Cells) para mostrar Código, Producto y Equivalente de forma compacta y legible.\r\nDatos Financieros: Se agregaron columnas de Inversión Total y % de Participación individual por repuesto.\r\nDetección de Riesgo: El monitor de salud ahora detecta con precisión si falta una variante específica (Equivalente) en el inventario activo.\r\n🛠️ Mejoras de Usabilidad (UX)\r\nComparativa de Periodos: Nueva herramienta en el módulo CFO que compara el rendimiento financiero del periodo actual contra el periodo anterior automáticamente.\r\nTooltips Dinámicos: Textos de ayuda mejorados en todas las gráficas para evitar cortes en pantalla y explicar métricas complejas con lenguaje claro.\r\nGestión de Permisos: Nuevo permiso ver_kpis_financieros para restringir el acceso al módulo CFO solo a personal autorizado (Gerentes/Superusuarios).\r\n🐛 Correcciones de Errores\r\nSolucionado el error donde repuestos con el mismo código pero distinto equivalente se mezclaban en el carrito de compras.\r\nCorregido el error visual en la gráfica de \"Calidad del Ahorro\" donde no se mostraban correctamente los segmentos de la torta debido a un desajuste de claves.\r\nAjuste de estilos en tablas modales para evitar desbordamiento de texto en nombres de productos largos.\r\n⚠️ Notas de Actualización\r\nEsta versión incluye Migraciones de Base de Datos (V5 y V6) que agregan columnas históricas (precio_promedio_snapshot, equivalente) a las tablas de órdenes.\r\nLa migración se ejecuta automáticamente al iniciar el sistema.\r\nImportante: Los datos históricos de ahorro y clasificación ABC detallada comenzarán a poblarse con precisión a partir de las nuevas órdenes de compra generadas con esta versión.",
  "mandatory": false,
  "hash_sha256": "1CE9AAA6F273BAF5682415008C71A7B866C20B4E88E2E6FD683763D3CA7418C1"
}