{
  "version": "v7.6.2",
  "url_exe": "https://github.com/UlisesUzcategui/stockpro-updates/releases/download/v7.6.2/StockPro_Setup_v7.6.2.exe",
  "changelog": "StockPro v7.6.2 (Enterprise): Cybersecurity Shield & Data Vault 🛡️\r\nEsta actualización crítica se centra en el blindaje de la infraestructura. Hemos eliminado por completo el almacenamiento de credenciales en texto plano, implementando un sistema de encriptación de grado militar para proteger los datos de conexión y las llaves de API. Además, se ha robustecido el motor de actualizaciones para garantizar la integridad de los datos durante la transición.\r\n🔐 Nuevas Características de Seguridad\r\n1. Bóveda de Credenciales (Encryption At-Rest)\r\nAdiós al .env: Se ha eliminado el uso de archivos de configuración legibles.\r\nEncriptación AES-256: Ahora, la IP del servidor, la contraseña de la base de datos, el Token de Telegram y el Salt de Licencia se almacenan en un contenedor binario (system_config.dat) encriptado y oculto al sistema operativo.\r\nProtección contra Fuga de Datos: Incluso si un usuario copia la carpeta de instalación a una unidad USB externa, no podrá leer las credenciales de acceso al servidor.\r\n2. Deployer Protegido (\"Modo Dios\")\r\nLa herramienta de configuración de red (StockPro_Deployer.exe) ha sido rediseñada bajo el principio de Security by Obscurity:\r\nInterfaz Bloqueada: Al abrir la herramienta, la configuración no es visible.\r\nAcceso de Superusuario: Se requiere una secuencia de activación oculta (10 clics en el logo) y una contraseña maestra para desencriptar y visualizar los parámetros de conexión.\r\n3. Auto-Blindaje de Migración\r\nTransición Transparente: El sistema detecta automáticamente si una instalación antigua utiliza archivos .env vulnerables. En el primer arranque, lee las credenciales, genera la bóveda encriptada y elimina de forma segura (Wipe) el archivo de texto plano original sin intervención del usuario.\r\n⚙️ Mejoras de Ingeniería\r\nMotor de Actualización Híbrido (Dual Backup): El script de auto-actualización ha sido reescrito para manejar escenarios mixtos. Ahora realiza copias de seguridad de seguridad tanto de configuraciones heredadas (.env) como de las nuevas encriptadas (.dat) antes de aplicar parches, garantizando que la conexión al servidor nunca se pierda tras un reinicio.\r\nGestión de Atributos de Windows: El sistema ahora gestiona dinámicamente los atributos de archivo (+Hidden) para permitir la sobreescritura segura de configuraciones durante el mantenimiento.\r\n📊 Recap: Funcionalidades Enterprise Recientes\r\nSi vienes de versiones anteriores a la v7.6.0, ahora también cuentas con:\r\nMódulo CFO (Inteligencia Financiera): Dashboard de ROI, Proyección de Flujo de Caja y Auditoría de Ahorros.\r\nIntegración Telegram: Bot con IA conversacional para ventas y consultas de inventario remotas.\r\nSincronización en Tiempo Real: Las tasas de cambio (BCV/Divisa) se replican instantáneamente en todas las estaciones de la red.",
  "mandatory": false,
  "hash_sha256": "E2FDA789CFCBC2327E0958A23F4F4990B4430D285671FAE662C1E236EA3666B0"
}